config/cicd/performance.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Load test"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  
scenarios:
  - name: "Health check"
    flow:
      - get:
          url: "/health"
  
  - name: "API Gateway"
    flow:
      - post:
          url: "/api/v1/unified"
          json:
            action: "process"
            query: "测试查询"
  
  - name: "Business Integration"
    flow:
      - get:
          url: "/business-integration"
  
  - name: "Knowledge System"
    flow:
      - get:
          url: "http://localhost:3000"